<?php $hive = \Base::instance(); ?>

<section>
    <h2><?= $hive->get("web.как_это_устроено_") ?>
    </h2>
    <p class='text-center text-balance max-w-200 mx-auto'><?= $hive->get("web.мы_собрали_способы_с_помощью_которых_на_протяжении_тысячелетий_искали_ответы_принимали_важные_решения_просили_совета_и_пытались_заглянуть_в_будущее_") ?>
    </p>

    <ul class='grid gap-15 lg:gap-y-22 lg:grid-cols-2 xl:grid-cols-3 place-content-center mt-15 text-balance text-center'>

        <?php slot(
            'components/web/ui/hiw-card',
            ['idx' => 1]
        ); ?>
        <div>
            <h3><?= $hive->get("web.загляните_") ?> </h3>
            <p>
                qquila1 Что привело вас в Lavanda? qquila2
            </p>
            <p>
                qquila1 В чем сегодня особенно нужна поддержка? qquila2
            </p>
            <p class='font-bold text-primary'><?= $hive->get("web.позвольте_первой_заговорить_с_вами_") ?>
            </p>
            <p><?= $hive->get("web.начните_с_авторского_оракула_именно_здесь_многие_с_удивлением_понимают_что_привело_их_сегодня_") ?>
            </p>
        </div>

        <?= component('web/ui/button', [
            'variant' => 'accent',
            'size' => 'sm',
            'href' => \Base::instance()->alias('bonus'),
            'slot' => $hive->get("web.начать_знакомство"),
            'class' => "mx-auto mt-[1.5em] w-fit"
        ]) ?>
        <?php end_slot(); ?>

        <?php slot(
            'components/web/ui/hiw-card',
            ['idx' => 2]
        ); ?>
        <div>
            <h3><?= $hive->get("web.познакомьтесь_") ?>
            </h3>
            <p class='font-bold text-primary'><?= $hive->get("web.исследуйте_разные_способы_поддержки_бережно_собранные_и_адаптированные_авторами_") ?>
            </p>
            <p><?= $hive->get("web.древняя_мудрость_разных_культур_и_эпох_современные_практики_и_проверенные_временем_инструменты_всё_что_помогало_людям_лучше_понимать_себя_много_веков_назад_и_продолжает_помогать_сегодня_") ?>
            </p>
            <p><?= $hive->get("web.руны_таро_книга_перемен_тибетское_мо_древние_расклады_на_камнях_метафорические_карты_игры_разума_и_многое_другое_") ?>
            </p>
            <p class='font-bold text-primary'><?= $hive->get("web.ваш_вопрос_ваше_время_ваш_путь_") ?>
            </p>
        </div>
        <?php end_slot(); ?>

        <?php slot(
            'components/web/ui/hiw-card',
            [
                'class' => 'lg:col-span-2 xl:col-span-1',
                'idx' => 3
            ]
        ); ?>
        <div>
            <h3><?= $hive->get("web.возвращайтесь_если_захочется_") ?>
            </h3>
            <p><?= $hive->get("web.если_почувствуете_что_стала_для_вас_местом_куда_хочется_заглядывать_снова_откройте_всё_пространство_или_пользуйтесь_только_теми_инструментами_которые_стали_вам_особенно_близки_") ?>
            </p>
            <p><?= $hive->get("web.без_обязательств_без_скрытых_условий_всё_только_по_вашему_желанию_") ?>
            </p>
            <p class='font-bold text-primary'><?= $hive->get("web.в_всё_происходит_по_любви_без_давления_без_спешки_и_с_уважением_к_вашему_выбору_") ?>
            </p>
        </div>
        <?php end_slot(); ?>
    </ul>
</section>
