<?php

return [
    [
        'id' => 1,
        'img' => '/assets/dices/dice-1/dice-1',
        'name' => 'ах',
        'meaning' => 'звук пустоты',
        'description' => 'Равновесие, ясность, Инь. Первозданный звук — начало всех мантр',
    ],
    [
        'id' => 2,
        'img' => '/assets/dices/dice-2/dice-2',
        'name' => 'па',
        'meaning' => 'вода, глубина',
        'description' => 'Питание, нектар, поток. Глубина, из которой рождается жизнь',
    ],
    [
        'id' => 3,
        'img' => '/assets/dices/dice-3/dice-3',
        'name' => 'на',
        'meaning' => 'земля, концентрация',
        'description' => 'Устойчивость, сосредоточенность, Ян. Сила, уходящая корнями вглубь',
    ],
    [
        'id' => 4,
        'img' => '/assets/dices/dice-4/dice-4',
        'name' => 'ра',
        'meaning' => 'образ пламени',
        'description' => 'Огонь, движение, сила. Энергия, которая может согреть или сжечь.',
    ],
    [
        'id' => 5,
        'img' => '/assets/dices/dice-5/dice-5',
        'name' => 'ца',
        'meaning' => 'быстрая реализация',
        'description' => 'Скорость воплощения. Желаемое приходит стремительно при правильном намерении.',
    ],
    [
        'id' => 6,
        'img' => '/assets/dices/dice-6/dice-6',
        'name' => 'дхи',
        'meaning' => 'слог Манджушри',
        'description' => 'Мудрость, совершенство разума. Семенной слог Бодхисаттвы Мудрости.',
    ],
];
