<?php slot('layouts/web/app-layout', [
    'title' => 'Мне грустно',
    'class' => "bg-background"
]); ?>

<!-- Hero Section -->
<?= partial('web/decision/hero') ?>

<section>
    <div class='mx-auto max-w-xl lg:flex lg:*:flex-1 lg:max-w-full lg:gap-23'>
        <div class='mb-[1.5em] lg:mb-0'>
            <h2 class='text-left lg:text-left text-2xl md:text-4xl lg:text-5xl font-bold normal-case'>
                Правильного решения в реальности не существует - есть только сделанный выбор и его последствия.
            </h2>
            <small class='text-xl md:text-2xl lg:text-3xl text-primary font-semibold'>Эльчин Сафарли</small>
        </div>
        <div class='space-y-[0.75em] text-balance lg:translate-y-23 lg:-mb-23'>
            <p>В этом разделе собраны символические системы разных культур. Каждая из них предлагает свой взгляд на происходящее: через архетипы, древние тексты, образы, звуки или случайность.</p>
        </div>
    </div>
</section>
<?php

$items = [
    [
        'title' => 'Практика',
        'exerpt' => 'Современные техники принятия решений и анализа ситуации помогают навести порядок в мыслях, увидеть новые варианты и сделать следующий шаг более осознанно. Здесь собраны простые упражнения, которые легко применять в жизни и работе. Попробуйте одну из практик - порой решение становится очевиднее уже после нескольких минут спокойного анализа.',
        'url' => '/'
    ],
    [
        'title' => 'Руны',
        'exerpt' => 'Задолго до появления современных психологических методик жители Северной Европы вырезали руны на камне, дереве и металле. Для них это был алфавит, память народа и язык символов. Сегодня руны продолжают жить уже в другом качестве - как способ поддержки, поиск предсказаний, как амулет или знак со смыслом. Задай вопрос и узнай, какую руну сегодняшний день приготовил тебе.',
        'url' => '/'
    ],
    [
        'title' => 'Расклад карт',
        'exerpt' => 'На протяжении веков люди замечали, что символы начинают звучать иначе, когда появляются рядом друг с другом. Так рождается история — со своими вопросами, поворотами и неожиданными деталями. Именно в этих сочетаниях многие находят мысли, которых прежде не замечали. Выбери колоду по душе и посмотри, какая история сложится.',
        'url' => '/'
    ],
    [
        'title' => 'Книга перемен (И-Цзин)',
        'exerpt' => 'Книга Перемен» сопровождает китайскую философию почти три тысячи лет. Её не читают как обычную книгу — с ней советуются. Каждая гексаграмма предлагает не готовый ответ, а другой взгляд на происходящее, позволяя увидеть ситуацию шире. Бросай три древние монеты и расшифруй свою гексаграмму прямо сейчас',
        'url' => '/'
    ],
    [
        'title' => 'Игры разума',
        'exerpt' => 'Этот простой, но невероятно действенный полезный инструмент в виде колоды МАК я получила от члена Профессиональной психотерапевтической лиги. С разрешения автора эти карты используются и у нас.',
        'url' => '/'
    ]
]; ?>

<section>
    <ul class='grid sm:grid-cols-[repeat(auto-fill,35.4rem)] gap-y-15 sm:gap-17 lg:gap-23 justify-center lg:even:-mb-23'>
        <?php foreach ($items as $idx => $item) : ?>
            <li class='bg-white rounded-xl px-4 xs:px-6 lg:px-12 space-y-[1em] transition-[outline] ease-in-out duration-200 hover:ring-4 hover:ring-primary relative sm:px-10 py-11 w-full shadow-accent lg:even:translate-y-23'>
                <?= component('shared/ui/image', [
                    'sizes' => 'mb',
                    'path' => '/assets/images/pages/decision/item-' . $idx + 1,
                    'prt_class' => 'mx-auto w-full max-w-2/3 aspect-square',
                    'img_class' => $idx !== 4 ? 'object-contain' : '',
                ]) ?>

                <h3 class='uppercase md:text-3xl lg:text-3xl'><?= $item['title'] ?></h3>
                <p><?= $item['exerpt'] ?></p>
                <a href="<?= $item['url'] ?>" class='absolute inset-0'></a>
            </li>
        <?php endforeach; ?>
    </ul>
</section>

<?php end_slot(); ?>
