<?php slot('layouts/web/app-layout', [
    'title' => $hive->get("web.мне_грустно"),
    'class' => "bg-background"
]); ?>

<?php $hive = \Base::instance(); ?>
<!-- Hero Section -->
<?= partial('web/sadness/hero') ?>

<section>
    <div class='mx-auto max-w-xl lg:flex lg:*:flex-1 lg:max-w-full lg:gap-23'>
        <h2 class='text-left lg:text-left text-2xl md:text-4xl lg:text-5xl font-bold normal-case'><?= $hive->get("web.пространство_где_можно_немного_помолчать_вместе_с_собой_") ?>
        </h2>
        <div class='space-y-[0.75em] text-balance lg:translate-y-23 lg:-mb-23'>
            <p><?= $hive->get("web.не_каждая_грусть_просит_чтобы_её_прогоняли_иногда_она_приходит_лишь_затем_чтобы_вы_ненадолго_остановились_") ?>
            </p>

            <p><?= $hive->get("web.здесь_не_нужно_искать_правильные_слова_или_правильные_решения_достаточно_выбрать_то_что_откликается_именно_сегодня_карту_руну_гексаграмму_историю_или_голос_") ?>
            </p>

            <p>

                <?= $hive->get("web.порой_одно_случайное_совпадение_один_образ_или_одна_фраза_становятся_тем_самым_маленьким_огоньком_которого_так_не_хватало_внутри_") ?>


            </p>
        </div>
    </div>
</section>
<?php

$items = [
    [
        'title' => $hive->get("web.руны"),
        'exerpt' => $hive->get("web.задолго_до_появления_современных_психологических_методик_жители_северной_европы_вырезали_руны_на_камне_дереве_и_металле_для_них_это_был_алфавит_память_народа_и_язык_символов_сегодня_руны_продолжают_жить_уже_в_другом_качестве_как_способ_поддержки_поиск_предсказаний_как_амулет_или_знак_со_смыслом_задай_вопрос_и_узнай_какую_руну_сегодняшний_день_приготовил_тебе"),
        'url' => $hive->alias('runes')
    ],
    [
        'title' => $hive->get("web.старинное_гадание_госпожи_ленорман"),
        'exerpt' => $hive->get("web.миниатюрные_сцены_символы_и_повседневные_образы_собранные_в_особую_колоду_в_каждом_сочетании_карт_свой_сценарий_который_может_подсказать_неочевидное_направление_или_подсветить_скрытую_деталь_ситуации"),
        'url' => $hive->alias('lenormand')
    ],
    [
        'title' => $hive->get("web.метафорические_карты"),
        'exerpt' => $hive->get("web.каждая_карта_здесь_это_образ_который_раскрывается_поразному_для_каждого_человека_иногда_одна_случайно_выбранная_карта_оказывается_удивительно_созвучной_тому_что_происходит_внутри_именно_с_таких_совпадений_часто_начинается_разговор_с_собой_вместе_с_каждой_картой_вас_сопровождают_вопросы_и_размышления_созданные_профессиональным_психотерапевтом_в_гештальтподходе_это_направляет_внимание_помогает_увидеть_ситуацию_с_новой_стороны_и_услышать_ответы_которые_уже_есть_внутри_вас"),
        'url' => $hive->alias('metaphoric')
    ],
    [
        'title' => $hive->get("web.расклад_таро"),
        'exerpt' => $hive->get("web.карты_таро_это_язык_вечных_сюжетов_колода_из_архетипов_от_силы_до_дурака_каждая_карта_отражает_какойто_этап_пути_эмоцию_или_выбор_позвольте_этим_образам_стать_зеркалом_для_ваших_вопросов_и_размышлений"),
        'url' => $hive->alias('tarot')
    ],
    [
        'title' => $hive->get('web._гадание_по_книге_перемен_ицзин_'),
        'exerpt' => $hive->get("web.книга_перемен_сопровождает_китайскую_философию_почти_три_тысячи_лет_её_не_читают_как_обычную_книгу_с_ней_советуются_каждая_гексаграмма_предлагает_не_готовый_ответ_а_другой_взгляд_на_происходящее_позволяя_увидеть_ситуацию_шире_бросай_три_древние_монеты_и_расшифруй_свою_гексаграмму_прямо_сейчас"),
        'url' => '/'
    ]
];; ?>

<section>
    <ul class='grid sm:grid-cols-[repeat(auto-fill,28rem)] xl:grid-cols-[repeat(auto-fill,35.4rem)] gap-y-15 sm:gap-17 2xl:gap-23 justify-center lg:even:-mb-23'>
        <?php foreach ($items as $idx => $item) : ?>
            <li class='bg-white rounded-xl px-8 lg:px-12 space-y-[1em] transition-[outline] ease-in-out duration-200 hover:ring-4 hover:ring-primary relative sm:px-10 py-11 w-full shadow-accent lg:even:translate-y-23'>
                <?= component('shared/ui/image', [
                    'sizes' => 'mb',
                    'path' => '/assets/images/pages/sadness/item-' . $idx + 1,
                    'prt_class' => 'mx-auto w-full max-w-2/3 aspect-square bg-contain!',
                    'img_class' => $idx !== 4 ? 'object-contain' : '',
                ]) ?>

                <h3 class='uppercase md:text-3xl lg:text-3xl'><?= $item['title'] ?></h3>
                <p><?= $item['exerpt'] ?></p>
                <a href="<?= $item['url'] ?>" class='absolute inset-0'></a>
            </li>
        <?php endforeach; ?>
    </ul>
</section>

<?php end_slot(); ?>
