<?php slot('layouts/web/app-layout', [
    'title' => 'Мне грустно',
    'class' => "bg-background"
]); ?>

<?php $hive = \Base::instance() ;?>
<!-- Hero Section -->
<?= partial('web/sadness/hero') ?>

<section>
    <div class='mx-auto max-w-xl lg:flex lg:*:flex-1 lg:max-w-full lg:gap-23'>
        <h2 class='text-left lg:text-left text-2xl md:text-4xl lg:text-5xl font-bold normal-case'>Пространство, где можно немного помолчать вместе с собой.</h2>
        <div class='space-y-[0.75em] text-balance lg:translate-y-23 lg:-mb-23'>
            <p>Не каждая грусть просит, чтобы её прогоняли. Иногда она приходит лишь затем, чтобы вы ненадолго остановились.</p>

            <p>Здесь не нужно искать правильные слова или правильные решения. Достаточно выбрать то, что откликается именно сегодня: карту, руну, гексаграмму, историю или голос.</p>

            <p>Порой одно случайное совпадение, один образ или одна фраза становятся тем самым маленьким огоньком, которого так не хватало внутри.
            </p>
        </div>
    </div>
</section>
<?php

$items = [
    [
        'title' => 'Руны',
        'exerpt' => 'Задолго до появления современных психологических методик жители Северной Европы вырезали руны на камне, дереве и металле. Для них это был алфавит, память народа и язык символов. Сегодня руны продолжают жить уже в другом качестве - как способ поддержки, поиск предсказаний, как амулет или знак со смыслом. Задай вопрос и узнай, какую руну сегодняшний день приготовил тебе.',
        'url' => '/'
    ],
    [
        'title' => 'Старинное гадание госпожи ленорман',
        'exerpt' => 'Миниатюрные сцены, символы и повседневные образы, собранные в особую колоду. В каждом сочетании карт — свой сценарий, который может подсказать неочевидное направление или подсветить скрытую деталь ситуации.',
        'url' => '/'
    ],
    [
        'title' => 'Метафорические карты',
        'exerpt' => 'Каждая карта здесь - это образ, который раскрывается по-разному для каждого человека. Иногда одна случайно выбранная карта оказывается удивительно созвучной тому, что происходит внутри. Именно с таких совпадений часто начинается разговор с собой. Вместе с каждой картой вас сопровождают вопросы и размышления, созданные профессиональным психотерапевтом в гештальт-подходе. Это направляет внимание, помогает увидеть ситуацию с новой стороны и услышать ответы, которые уже есть внутри вас.',
        'url' => $hive->alias('metaphoric')
    ],
    [
        'title' => 'Расклад таро',
        'exerpt' => 'Карты Таро - это язык вечных сюжетов. Колода из 78 архетипов — от Силы до Дурака. Каждая карта отражает какой-то этап пути, эмоцию или выбор. Позвольте этим образам стать зеркалом для ваших вопросов и размышлений.',
        'url' => $hive->alias('tarot')
    ],
    [
        'title' => 'Гадание по книге перемен (И-Цзин)',
        'exerpt' => 'Книга Перемен» сопровождает китайскую философию почти три тысячи лет. Её не читают как обычную книгу — с ней советуются. Каждая гексаграмма предлагает не готовый ответ, а другой взгляд на происходящее, позволяя увидеть ситуацию шире. Бросай три древние монеты и расшифруй свою гексаграмму прямо сейчас',
        'url' => '/'
    ]
];; ?>

<section>
    <ul class='grid sm:grid-cols-[repeat(auto-fill,28rem)] xl:grid-cols-[repeat(auto-fill,35.4rem)] gap-y-15 sm:gap-17 2xl:gap-23 justify-center lg:even:-mb-23'>
        <?php foreach ($items as $idx => $item) : ?>
            <li class='bg-white rounded-xl px-8 lg:px-12 space-y-[1em] transition-[outline] ease-in-out duration-200 hover:ring-4 hover:ring-primary relative sm:px-10 py-11 w-full shadow-accent lg:even:translate-y-23'>
                <?= component('shared/ui/image', [
                    'sizes' => 'mb',
                    'path' => '/assets/images/pages/sadness/item-' . $idx + 1,
                    'prt_class' => 'mx-auto w-full max-w-2/3 aspect-square',
                    'img_class' => $idx !== 4 ? 'object-contain' : '',
                ]) ?>

                <h3 class='uppercase md:text-3xl lg:text-3xl'><?= $item['title'] ?></h3>
                <p><?= $item['exerpt'] ?></p>
                <a href="<?= $item['url'] ?>" class='absolute inset-0'></a>
            </li>
        <?php endforeach; ?>
    </ul>
</section>

<?php end_slot(); ?>
